In [33]:
import numpy as np
import pandas as pd

In [34]:
one = {'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3']}

In [35]:
two = {'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']}

In [36]:
data_1 = pd.DataFrame(one)

In [37]:
data_2 = pd.DataFrame(two)

In [38]:
data_1

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [39]:
data_2

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [40]:
pd.concat([data_1,data_2],axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [41]:
pd.concat([data_1,data_2])

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [42]:
data_2.columns = data_1.columns

In [43]:
data_2

    A   B
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [44]:
c_data = pd.concat([data_1,data_2])

In [45]:
c_data.index = range(len(c_data))

In [46]:
c_data

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  C0  D0
5  C1  D1
6  C2  D2
7  C3  D3

In [47]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [48]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [49]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [50]:
data = pd.merge(registrations,logins,how='inner',on='name')
data

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

In [51]:
pd.merge(left=registrations,right=logins,how='left',on='name') # all contents of left + comman of right

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [52]:
pd.merge(left=registrations,right=logins,how='right',on='name') # all contents of right with comman left

   reg_id     name  log_id
0     1.0   Andrew       2
1     2.0     Bobo       4
2     NaN   Xavier       1
3     NaN  Yolanda       3

In [57]:
pd.merge(registrations,logins,how='outer',on='name')

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [55]:
data

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [56]:
# merge on index

In [61]:
registrations = registrations.set_index('name')

In [63]:
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [64]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [65]:
pd.merge(registrations,logins,how='inner',left_index=True,right_on='name')

   reg_id  log_id    name
1       1       2  Andrew
3       2       4    Bobo

In [66]:
registrations = registrations.reset_index()

In [69]:
registrations.columns = ['name','id']

In [70]:
logins.columns = ['id','name']

In [71]:
registrations

     name  id
0  Andrew   1
1    Bobo   2
2  Claire   3
3   David   4

In [72]:
logins

   id     name
0   1   Xavier
1   2   Andrew
2   3  Yolanda
3   4     Bobo

In [75]:
pd.merge(registrations,logins,how='inner',on='name')

     name  id_x  id_y
0  Andrew     1     2
1    Bobo     2     4

In [76]:
pd.merge(registrations,logins,how='inner',on='name',suffixes=('_reg','_log'))

     name  id_reg  id_log
0  Andrew       1       2
1    Bobo       2       4

In [82]:
registrations.columns = ['reg_name','reg_id']
registrations

  reg_name  reg_id
0   Andrew       1
1     Bobo       2
2   Claire       3
3    David       4

In [83]:
logins.columns = ['log_id','log_name']
logins

   log_id log_name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [85]:
d = pd.merge(registrations,logins,how='inner',left_on='reg_name',right_on='log_name')

In [86]:
d.drop('log_name',axis=1)

  reg_name  reg_id  log_id
0   Andrew       1       2
1     Bobo       2       4